app/controllers/entries_controller.rb

INSERT INTO "entries" ("choice", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["choice", "ruby"], ["created_at", Thu, 04 Apr 2013 05:39:53 UTC +00:00], ["updated_at", Thu, 04 Apr 2013 05:39:53 UTC +00:00]]
---
  def create
    Entry.create(:choice =>params[:choice]) redirect_to '/'